ahtn/keyplus/efm8/efm8/mcu/C8051F530/inc/SI_C8051F530_Register_Enums.h
#define ADC0CN_ADEN__BMASK            0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT            0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED         0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN_ADEN__ENABLED          0x80 ///< Enable ADC0 (active and ready for data            
                                           ///< conversions).                                     
                                                                                                  
//------------------------------------------------------------------------------
// ADC0GNA Enums (ADC0 Adjustable Selectable Gain @ 0x08)
//------------------------------------------------------------------------------
#define ADC0GNA_GAINADD__BMASK    0x01 ///< Additional Gain Control                         
#define ADC0GNA_GAINADD__SHIFT    0x00 ///< Additional Gain Control                         
#define ADC0GNA_GAINADD__DISABLED 0x00 ///< Do not add any additional gain to the value in  
                                       ///< ADC0GNH:L.                                      
#define ADC0GNA_GAINADD__ENABLED  0x01 ///< Add 1/64 (0.016) gain to the value in ADC0GNH:L.
                                                                                            
//------------------------------------------------------------------------------
// ADC0GNH Enums (ADC0 Selectable Gain High @ 0x04)
//------------------------------------------------------------------------------
#define ADC0GNH_GAINH__FMASK 0xFF ///< Selectable Gain High
#define ADC0GNH_GAINH__SHIFT 0x00 ///< Selectable Gain High
                                                           
//------------------------------------------------------------------------------
// ADC0GNL Enums (ADC0 Selectable Gain Low @ 0x07)
//------------------------------------------------------------------------------
#define ADC0GNL_GAINL__FMASK 0xF0 ///< Selectable Gain Low
#define ADC0GNL_GAINL__SHIFT 0x04 ///< Selectable Gain Low
                                                          
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select channel ADC0.0.       
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select channel ADC0.1.       
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select channel ADC0.2.       
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select channel ADC0.3.       
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select channel ADC0.4.       
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select channel ADC0.5.       
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select channel ADC0.6.       
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select channel ADC0.7.       
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select channel ADC0.8.       
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select channel ADC0.9.       
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select channel ADC0.10.      
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select channel ADC0.11.      
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select channel ADC0.12.      
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select channel ADC0.13.      
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select channel ADC0.14.      
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select channel ADC0.15.      
#define ADC0MX_ADC0MX__TEMP    0x18 ///< Temperature Sensor.          
#define ADC0MX_ADC0MX__VDD     0x19 ///< VDD Supply Voltage.          
#define ADC0MX_ADC0MX__GND     0x1F ///< Ground.                      
                                                                      
//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xBA)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK         0x03 ///< Post Tracking Time                                
#define ADC0TK_ADTK__SHIFT         0x00 ///< Post Tracking Time                                
#define ADC0TK_ADTK__2_SAR_CLOCKS  0x00 ///< Post-Tracking time is equal to 2 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__4_SAR_CLOCKS  0x01 ///< Post-Tracking time is equal to 4 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__8_SAR_CLOCKS  0x02 ///< Post-Tracking time is equal to 8 SAR clock cycles 
                                        ///< + 2 FADCCLK cycles.                               
#define ADC0TK_ADTK__16_SAR_CLOCKS 0x03 ///< Post-Tracking time is equal to 16 SAR clock cycles
                                        ///< + 2 FADCCLK cycles.                               
                                                                                               
#define ADC0TK_ADTM__FMASK         0x0C ///< Tracking Mode                                     
#define ADC0TK_ADTM__SHIFT         0x02 ///< Tracking Mode                                     
#define ADC0TK_ADTM__POST_TRACKING 0x04 ///< ADC0 is configured to Post-Tracking Mode.         
#define ADC0TK_ADTM__PRE_TRACKING  0x08 ///< ADC0 is configured to Pre-Tracking Mode.          
#define ADC0TK_ADTM__DUAL_TRACKING 0x0C ///< ADC0 is configured to Dual-Tracking Mode.         
                                                                                               
#define ADC0TK_ADPWR__FMASK        0xF0 ///< Burst Mode Power Up Time                          
#define ADC0TK_ADPWR__SHIFT        0x04 ///< Burst Mode Power Up Time                          
                                                                                               
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
