ahtn/keyplus/efm8/efm8/mcu/C8051F530/inc/SI_C8051F530_Register_Enums.h
#define EIE1_EPCA0__BMASK     0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x02 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x04 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0F__BMASK     0x08 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__SHIFT     0x03 ///< Comparator0 (CP0) Falling Edge Interrupt Enable   
#define EIE1_ECP0F__DISABLED  0x00 ///< Disable CP0 falling edge interrupts.              
#define EIE1_ECP0F__ENABLED   0x08 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPFIF flag.                          
                                                                                          
#define EIE1_ECP0R__BMASK     0x10 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__SHIFT     0x04 ///< Comparator0 (CP0) Rising Edge Interrupt Enable    
#define EIE1_ECP0R__DISABLED  0x00 ///< Disable CP0 rising edge interrupts.               
#define EIE1_ECP0R__ENABLED   0x10 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF flag.                          
                                                                                          
#define EIE1_ELIN0__BMASK     0x20 ///< LIN0 Interrupt Enable                             
#define EIE1_ELIN0__SHIFT     0x05 ///< LIN0 Interrupt Enable                             
#define EIE1_ELIN0__DISABLED  0x00 ///< Disable LIN0 interrupts.                          
#define EIE1_ELIN0__ENABLED   0x20 ///< Enable interrupt requests generated by LIN0.      
                                                                                          
#define EIE1_EREG0__BMASK     0x40 ///< Voltage Regulator Interrupt Enable                
#define EIE1_EREG0__SHIFT     0x06 ///< Voltage Regulator Interrupt Enable                
#define EIE1_EREG0__DISABLED  0x00 ///< Disable the voltage regulator dropout interrupt.  
#define EIE1_EREG0__ENABLED   0x40 ///< Enable the voltage regulator dropout interrupt.   
                                                                                          
#define EIE1_EMAT__BMASK      0x80 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__SHIFT      0x07 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                
#define EIE1_EMAT__ENABLED    0x80 ///< Enable interrupt requests generated by a Port     
                                   ///< Match.                                            
                                                                                          
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PWADC0__BMASK 0x01 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__SHIFT 0x00 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt set to low priority level.            
#define EIP1_PWADC0__HIGH  0x01 ///< ADC0 Window interrupt set to high priority level.           
                                                                                                 
#define EIP1_PADC0__BMASK  0x02 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__SHIFT  0x01 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt set to low               
                                ///< priority level.                                             
#define EIP1_PADC0__HIGH   0x02 ///< ADC0 Conversion Complete interrupt set to high              
                                ///< priority level.                                             
                                                                                                 
#define EIP1_PPCA0__BMASK  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__SHIFT  0x02 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt set to low priority level.                   
#define EIP1_PPCA0__HIGH   0x04 ///< PCA0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PCP0F__BMASK  0x08 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control   
#define EIP1_PCP0F__SHIFT  0x03 ///< Comparator0 (CP0) Falling Edge Interrupt Priority Control   
#define EIP1_PCP0F__LOW    0x00 ///< CP0 falling edge interrupt set to low priority              
                                ///< level.                                                      
#define EIP1_PCP0F__HIGH   0x08 ///< CP0 falling edge interrupt set to high priority             
                                ///< level.                                                      
                                                                                                 
#define EIP1_PCP0R__BMASK  0x10 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control    
#define EIP1_PCP0R__SHIFT  0x04 ///< Comparator0 (CP0) Rising Edge Interrupt Priority Control    
#define EIP1_PCP0R__LOW    0x00 ///< CP0 rising edge interrupt set to low priority               
                                ///< level.                                                      
#define EIP1_PCP0R__HIGH   0x10 ///< CP0 rising edge interrupt set to high priority              
                                ///< level.                                                      
                                                                                                 
